feanor-anglin/ArduinoHwSAMD/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

gowired_gw_samd.name=GoWired Multiprotocol Gateway
gowired_gw_samd.vid.0=0x1209
gowired_gw_samd.pid.0=0x6949
gowired_gw_samd.vid.1=0x1209
gowired_gw_samd.pid.1=0x6948
gowired_gw_samd.upload.tool=bossac
gowired_gw_samd.upload.protocol=sam-ba
gowired_gw_samd.upload.maximum_size=262144
gowired_gw_samd.upload.use_1200bps_touch=true
gowired_gw_samd.upload.wait_for_upload_port=true
gowired_gw_samd.upload.native_usb=true
gowired_gw_samd.build.mcu=cortex-m0plus
gowired_gw_samd.build.f_cpu=48000000L
gowired_gw_samd.build.usb_product="GoWired Multiprotocol Gateway"
gowired_gw_samd.build.usb_manufacturer="Domatic"
gowired_gw_samd.build.board=SAMD_ZERO
gowired_gw_samd.build.core=arduino:arduino
gowired_gw_samd.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
gowired_gw_samd.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
gowired_gw_samd.build.openocdscript=openocd_scripts/gowired_gw.cfg
gowired_gw_samd.build.variant=gowired_gw
gowired_gw_samd.build.variant_system_lib=
gowired_gw_samd.build.vid=0x1209
gowired_gw_samd.build.pid=0x6949
gowired_gw_samd.build.arch=SAMD
gowired_gw_samd.bootloader.tool=openocd
gowired_gw_samd.bootloader.file=gowired_gw/samd21_sam_ba.bin
